ЧартерEDT.Расширение1/src/Documents/Message/Message.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6d8ac6d-9568-4c99-94ba-8ba41433b3e7">
  <name>Message</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f7efb441-2f96-4827-b986-a373a3aa619d">
    <name>IsClosed</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="713e5315-7200-4e2e-b8f9-298e174e2569">
    <name>ByObject</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="51914dcd-7ce4-49dd-9ff7-c3e9b0f9a741">
    <name>ValidFromDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e407e4e-4670-4e1d-bfb6-482ce4e8e75d">
    <name>ValidToDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1291995-ae77-483c-90bf-45b69bcc5a8d">
    <name>CloseToDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="628874d6-d0bd-44eb-a091-fb6594313fb0">
    <name>Type</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06263e36-9291-4887-b712-403ddf2f8c1f">
    <name>MessageStatus</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6244fc66-d97b-4df4-ac21-1361b196c07e">
    <name>ForDepartment</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60860c39-78e3-41ec-a816-aa1befb67788">
    <name>MessageType</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4e43f5f-a045-406d-b88e-5021cc1e6eed">
    <name>Remarks</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5198a270-cf99-41bd-8e62-f7504ff207f3">
    <name>ClosedBy</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d6a6870-75b3-40f6-a44e-9726aab60a63">
    <name>ForEmployee</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dcc32206-c0e6-45ef-84e1-168072e4267b">
    <name>PopUp</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eddd104-6050-4a7d-88fe-cb36817c650a">
    <name>Author</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c743adbe-d28c-415e-9a23-7f8c2ce6f120">
    <name>DateWhenClosed</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3e6cc838-019f-45f5-9a1e-6bbc6f707b0f">
    <name>ContactPerson</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/Enums/MessageTypes/MessageTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="823385cc-c67a-4183-953c-9c653c13c896">
  <name>MessageTypes</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b8077af8-10ca-411f-9747-3fd5dfdf6cb2">
    <name>Task</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЧартерEDT.Расширение1/src/Documents/Message/Forms/tcDocumentForm/Module.bsl
&AtServer
&ChangeAndValidate("OnCreateAtServer")
Procedure Расш1_OnCreateAtServer(Cancel, StandardProcessing)	
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;

	// Check protection system
	tcProtection.cmCheckForm(ThisForm);

	// Let's set the properties of the form
	tcOnServer.cmSetFormProperties(ThisForm);

	vObject = FormAttributeToValue("Object");
	vTempArray = New Array();

	pNewForm = Parameters.Key.IsEmpty();
	If pNewForm Then
		vObject.pmFillAttributesWithDefaultValues();
		Items.GroupMessage.Title = "" + vObject.Author;
		#Вставка
	    vObject.Type = Перечисления.MessageTypes.Task;
		Items.Type.ТолькоПросмотр = Истина;
		vObject.MessageStatus = Справочники.MessageStatuses.НайтиПоНаименованию("Новая");
		#КонецВставки

	Else
		Items.GroupMessage.Title = Format(vObject.Date, "DF='dd.MM.yyyy HH:mm'") + " - " + vObject.Author + " - " + TrimAll(vObject.Number);
	EndIf;

	If Parameters.Property("Type") Then
		If TypeOf(Parameters.Type) = Type("EnumRef.MessageTypes") Then
			vObject.Type = Parameters.Type;
		EndIf;
	EndIf;
	If Parameters.Property("SetParamObject") Then
		If not ValueIsFilled(vObject.ByObject) Then
			vObject.ByObject = Parameters.SetParamObject;
		EndIf;		
		If TypeOf(vObject.ByObject) = Type("CatalogRef.Rooms") Then
			ThisForm.SelRoom = vObject.ByObject;
		EndIf;
	EndIf;
	If Parameters.Property("SetEmployee") Then
		vObject.ForEmployee = Parameters.SetEmployee;
	EndIf;
	If Parameters.Property("SetOrder") Then
		vObject.ByOrder = Parameters.SetOrder;
	EndIf;
	If Parameters.Property("SetDepartment") Then
		vObject.ForDepartment = Parameters.SetDepartment;
	EndIf;
	If Parameters.Property("SetRemarks") Then
		vObject.Remarks = Parameters.SetRemarks;
	EndIf;
	If Parameters.Property("SetType") Then
		vObject.MessageType = Parameters.SetType;
	EndIf;

	// Check if there are any message types defined
	vMessageTypes = cmGetAllMessageTypes();
	If vMessageTypes.Count() = 0 Then
		Items.MessageType.Visible = False;
	Else
		Items.MessageType.Visible = True;
	EndIf;

	// Check if there are any message statuses defined
	vMessageStatuses = cmGetAllMessageStatuses();
	If vMessageStatuses.Count() = 0 Then
		Items.MessageStatus.Visible = False;
		Items.IsClosed.Visible = True;
	Else
		Items.IsClosed.Visible = False;
		Items.MessageStatus.Visible = True;
	EndIf;

	// Comments
	cNewPolAtServer();

	If vObject.IsClosed And Not(pNewForm) Then
		pEnabled = False;
		EnableAllItems(pEnabled, pNewForm);
	Else
		pEnabled = True;
		EnableAllItems(pEnabled, pNewForm);
	EndIf;

	If ValueIsFilled(SelRoom) And SelRoom = vObject.ByObject Then
		Items.ByObject.Visible = False;
	ElsIf ValueIsFilled(vObject.ByObject) And TypeOf(vObject.ByObject) <> Type("CatalogRef.Rooms") Then
		Items.SelRoom.Visible = False;
	EndIf;

	Items.GroupWhenClosed.Visible = vObject.IsClosed;

	GetPictureServer();

	ValueToFormAttribute(vObject, "Object");

	SetFormAppearanceAtServer();
EndProcedure
